var local_database = [
  {
    title: "象鼻山",
    content: "象鼻山主要景点有水月洞、象眼岩、普贤塔、云峰寺及寺内的太平天国革命遗址陈列馆等。附近还有隋唐开元寺仅存的舍利塔。水月洞紧靠江边, 漓水流贯其间, 如水中浮月,山石垂入水中如象鼻饮水漓江, 景致极佳, 唐宋以来即为游览胜地。\n宋蓟北处士《和水月洞韵》诗: “水底有明月, 水上明月浮。水流月不去, 月去水还流。”形象地描绘了这一景致。",
    imgSrc: "/images/test/xiangbishan.jpg",
    reading: 102,
    detail: "象鼻山原名漓山，地处于桂林市内桃花江与漓江汇流处，山因酷似一只站在江边伸鼻豪饮漓江甘泉的巨象而得名，被人们称为桂林山水的象征。象鼻山以神奇著称。其神奇，首先是形神毕似，其次是在鼻腿之间造就一轮临水明月，构成“象山水月”奇景。\n象鼻山是桂林的城徽山，是桂林旅游的标志山。它坐落在桂林市中心的漓江与桃花江汇流处，形似一头巨象，象鼻和象腿之间是面积约一百五十平米的圆洞，江水穿洞而过，如明月浮水。坐落西岸的象山水月与漓江东岸的穿月岩相对，一挂于天，一浮于水，形成“漓江双月”的奇特景观。",
    collection: 92,
    dateTime: "24小时前",
    headImgSrc: "/images/test/xiangbishan.jpg",
    author: "猫是猫的猫",
    date: "Nov 20 2020",
    avatar: "/images/avatar/5.png",
    postId: 0,
    music: {
      url: "http://music.163.com/song/media/outer/url?id=1372060183.mp3",
        title: "空-徐海俏",
        coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000",
    }
},

    {
        date: "Sep 18 2020",
        title: "玉龙雪山",
        imgSrc: "/images/test/yulongxueshan.jpg",
        avatar: "/images/avatar/1.png",
        content: "玉龙雪山在纳西语中被称为“欧鲁”，意为“天山”。其十三座雪峰连绵不绝，宛若一条“巨龙”腾越飞舞，故称为“玉龙”。又因其岩性主要为石灰岩与玄武岩，黑白分明，所以又称为“黑白雪山”。是纳西人的神山，传说纳西族保护神“三朵”的化身。",
        reading: "112",
        collection: "96",
        headImgSrc: "/images/test/yulongxueshan.jpg",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "玉龙雪山是北半球最南的大雪山。山势由北向南走向，南北长35公里，东西宽25公里，雪山面积960平方公里，高山雪域风景位于海拔4000米以上。\n玉龙雪山以险、奇、美、秀著称于世，气势磅礴，玲珑秀丽，随着时令和阴晴的变化，有时云蒸霞蔚、玉龙时隐时现；有时碧空如水，群峰晶莹耀眼；有时云带束腰，云中雪峰皎洁，云下岗峦碧翠；有时霞光辉映，雪峰如披红纱，娇艳无比。\n玉龙景观玉龙雪山是云南亚热带的极高山地，从山脚河谷到峰顶具备了亚热带、温带到寒带的完整的垂直带自然景观。雪山自然旅游资源丰富，景观大致可分为雪域·冰川景观、高山草甸景观、原始森林景观、雪山水景等。\n主峰扇子陡海拔5596米，是世界上北半球纬度最低、海拔最高的山峰。它位于中国云南省丽江西北，呈南北走向，东西宽约13公里，南北长约35公里，与哈巴雪山对峙，汹涌澎湃的金沙江奔腾其间。\n玉龙雪山在纳西族被称为“波石欧鲁”，意为白沙的银色山岩。整座雪山由十三峰组成，由北向南呈纵向排列，延绵近50公里，东西宽约13公里。玉龙雪山不仅气势磅礴，而且秀丽挺拔，造型玲珑，皎洁如晶莹的玉石，灿烂如十三把利剑，在碧蓝天幕的映衬下，像一条银色的玉龙在作永恒的飞舞，故名玉龙山。\n又因玉龙雪山的岩性主要为石灰岩与玄武岩，黑白分明，故又称为“黑白雪山”。",
        postId: 1,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1386866050.mp3",
            title: "笑看风云",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
    {
        //按住alt + shift + F 可以格式化代码样式
        title: "神农架",
        content: "神农架群山万壑，峰峦迭翠;峡谷天雕，奇洞天成;险崖瀑飞，锦石溪流;深山老林，云流雾绕，高山平原，碧海长天，构成一幅幅山水画卷，一个个诗画长廊。以强大的魅力，吸引着无数中外游人，成为独特的游览胜地。",
        detail: "相传上古时代神农氏（炎帝）曾在此遍尝百草，为民除病。由于千峰陡峭，珍贵药草生长在高峰绝壁之上，神农氏就伐木搭架而上，采得药草，救活百姓，神农架因此而得名。神农架最高峰神农顶海拔3105.4米，最低处海拔398米，平方海拔1700米，3000米以上山峰有6座，被誉为“华中屋脊”。\n神农架野生植物丰富，如珙桐、水杉、香果树、连香树、银杏、梭罗、红豆杉等。神农架也是一座天然百草药园，有中草药材2013种，如“头顶一颗珠”，“江边一碗水”，“七叶一枝花”，“文王一笔枝”天麻，党参，当归等。\n神农架凭借地理位置和地理环境的优越性，至今较好地保存着原始森林的特有风貌，神农架自然保护区属国家级森林和野生动物的自然保护区，被联合国教科文组织人与生物圈计划接纳为成员。\n神农架素有科学迷宫之称，除举世闻名的“野人”之谜外，还有神奇的白化动物，吸引着科学考察人员和海内外游客。神农架是我国国家级风景名胜区，主要景点有风景垭、板壁岩、大九湖、神农顶、植物园、炎帝祭坛、千年古杉、香溪源、天门垭、燕子垭、植物标本馆、红坪画廊、古犀牛洞等。\n白色动物王国--白雕、白獐、白猴、白鹿、白松鼠、白蛇和白熊。\n神农白熊，毛色纯白，性情温驯，头部很大，两耳竖立，一条不满二寸的小尾巴总是夹着，貌似大熊猫，只是嘴部比较突出。它生长在海拔1500米以上的原始森林和箭竹林中，以野果、竹笋、嫩叶为主要食物。神农白熊喜欢与人嬉闹，甚至主动爬到人们的怀里闭目养神。它的嗅觉灵敏，善于寻找食物，饱食后常手舞足蹈。神农白熊已被定为国家一级保护动物。\n白獐和白麂在古代就被人们视为国宝或神物。獐、麂同属哺乳纲偶蹄目鹿科的野生动物，古时统称为鹿。一般的獐、麂毛色呈黄褐色或黑褐色，而白獐和白麂通体毛色纯白，眼珠和皮呈粉红色。\n野人之谜--神农架的奇幻、神秘、引人入胜还在于它拥有一种传奇性动物-“野人”（亦称“雪人”或“大脚怪”）。50年代以来，神农架不时有“野人”存在的报告传来。\n1976年5月中国科学院组织了“鄂西北奇异动物考察队”深入神农架原始林区，探杳“野人”足迹。收集到了“野人”的烘便、毛发等实物，测杳了“野人”脚印。经初步鉴定，“野人”是一种接近于人类的高级灵长类动物。近几年来，又有多名考察队员和游人目睹了“野人”的存在。但到目前为止，还没有捕获到一个活的“野人”，因此神农架“野人”仍是一个谜。",
        imgSrc: "/images/test/shennongjia.jpg",
        headImgSrc: "/images/test/shennongjia.jpg",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2020",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=30031580.mp3",
            title: "原来你也在这里-秦昊",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
   {
        title: "鸡冠洞",
        content: "鸡冠洞是一处大型的石灰岩溶洞，喀斯特岩溶地貌，鸡冠洞长达5600米，供观赏长度1800余米，观赏面积2.3万平方米。此类洞穴在北方少见，被誉为北国第一洞府。",
        imgSrc: "/images/test/jiguandong1.jpg",
        reading: 102,
        detail: "洛阳栾川城西3公里的君山北麓，有一座陡峭的孤峰，貌似雄鸡昂首引颈高啼，山顶恰似鸡冠，景致秀美，山中有一个天然形成的地下溶洞，深幽莫测。山以形名，洞以山名，故名籍贯山溶洞。\n鸡冠洞发现于清朝乾隆年间。旧《栾川县志》称：“鸡冠洞，有四殿，如龙蛇之窟”、“蝙蝠如织，险象四伏”、“有樵者，操刀持棒，结伙秉烛而入”、“深幽莫测，惧而返。”。鸡冠洞蛰伏莽莽群山之中，蒙上了神秘莫测的面具，固拒来访，从此与世人隔绝。\n鸡冠洞被誉为“北国第一洞”。时值盛夏，鸡冠山遍披绿锦、满目苍翠。当我们登上３１８级石阶，站在幽深静谧的鸡冠洞口时，无不大汗淋漓。而入得洞内，迎面扑来的习习凉风令人神清气爽、暑热顿消。待置身色彩斑斓、瑰丽神奇的钟乳石世界时，已是颇有寒意了。\n洞内峰回路转，曲经通幽，景观布局疏密参差，钟乳石形象各异，姿态万千。洞内旅游资源丰富，洞中共有景点168个。尤其是“众仙迎客”、“金鱼渡仙翁”、“贵妃出浴”、“玉兔望月”、“海豚戏珠”、“鲤鱼戏水”、“八仙拜佛”等88个景观，姿态奇异，形象逼真。\n鸡冠洞属天然石灰岩溶洞，地质学上称她为喀斯特岩溶地貌。据专家考证，她形成于早、中更新纪，诸多景观早在六、七万年前就巳定形。早在清代就有人冒险探幽，然而因洞内深幽、奇险，惧而返。\n鸡冠洞，洞长1800米，观赏面积23000平方米，由八大景区连缀而成，依次为“玉柱潭”、“溢彩殿”、“叠帏宫”、“洞天河”、“瑶池宫”、“藏秀阁”、“逍遥宫”、“石林坊”，洞内峰回路转，曲径通幽，景观布局疏密参差，钟乳石形象各异，姿态万千，或如逸仙，如卧佛、如飞禽、如走兽；或如春笋、如密林、如竹帘、如帷幕，其景观无不栩栩如生，维妙维肖，一片片庞大的石幕犹如琴瑟，以石轻击，琴音清脆，余音袅袅，万石流淌的洞中河，清澈见底，“叮咚”作响，给静逸的鸡冠洞增添了无尽的活力！\n鸡冠洞旅游资源丰厚，洞中共有大小景点168个，尤其以“众仙迎客”、“金龟渡仙翁”、“贵妃出浴”、“玉兔望月”、“海豚戏珠”、“鲤鱼戏水”、“八仙拜寿”等88个景观，姿态奇异，形象逼真而倍受广大游客青睐。\n鸡冠洞考古科研价值极高。洞中石花、石旗、石瀑、石幔、石钟乳、石笋密布，据科研数据表明，较长石笋在18.4万年前就巳形成，现在通过石笋的内部结构、层状结构以及沉淀下来的物质，可考察出古气候、古环境、古地理等多方面的信息。另有石盾、莲花盆等，它们的结构成因及特征、形状属世界罕见，具有极高的考古价值和科研价值。\n鸡冠洞中一年四季恒温18摄氏度，严冬季节洞内热浪扑面，暖意融融、盛夏酷暑，洞中寒气侵袭，清神爽心，爽凉宜人，被称为“自然空调”。\n一九四年被河南省政府命名为“省级风景名胜区”，一九七年被省旅游局授予“河南省十佳旅游景区”。一九八年被河南省建设厅授予“风景区管理工作先进单位”、“文明服务示范窗口”、“全省风景卫生达标先进单位”。\n原新华社社长穆青为鸡冠洞欣然题名“北国第一洞”，中国地质学会洞穴研究会会长朱学稳教授为鸡冠洞作出了“景观壮丽、堪称北国第一洞府；成因独特，正是国内首家龙宫”的权威性评语。\n鸡冠洞主要由玉柱潭、飞瀑岩、斜塔殿、叠帏宫、瑶池宫、藏秀阁等６个厅堂和一条地下暗河———洞天河等景观组成。由石灰质水天然滴注凝成的石柱、石林、石塔、石帏、石琴布满了厅堂和四壁，在七彩灯光的映衬下，或装素裹或金碧辉煌，整个溶洞像一座玲珑剔透的雕塑艺术殿堂，更像神话传说中遍地奇珍异宝的水晶龙宫和海市蜃楼般神秘缥缈的人间仙境。\n进得玉柱潭，一群宽袍广袖、鹤发童颜的仙翁“拦”住了众人的去路。他们个个慈眉善目、笑容可掬，仿佛在热情地向游客问好，又似殷勤地为大家指路，那一张张神态逼真、栩栩如生的面孔，一下将众人带入了奇异的神话天地。进入飞瀑岩景区后，地下暗河的汩汩清泉和淙淙溪流，更为这座神仙洞府平添了生机与灵韵。厅堂内曲径通幽的长廊，时而宽阔得像个豪华气派的艺术舞台，时而又狭窄得仅容一人通过，且陡峭如削，让众人着实体验了一番地下攀岩的艰险。循着潺潺水声，峰回路转，移步换景，越往里走，洞中越显幽静，景致也更加迷人：玉兔望月、海豚戏珠、八仙过海、千年一吻、鲤鱼戏水、寿星抱桃……飞瀑岩下银河泄玉，如帘如雾；叠帏宫内千层折叠，万道帷幕；垂天罗帐里流光溢彩、丹霞似火；斜塔殿内的石塔玲珑剔透、伟岸巍峨。就连厅堂四周和壁顶，也是洞穴森森、景观重重。细细品来，每块钟乳石都仿佛被赋予了灵气和神韵，令人浮想联翩、惊叹不已。最使人感到奇妙的是点缀于壁顶、由方解石结晶形成的石花，像珊瑚、似雾凇、如树挂，晶莹无瑕，熠熠生辉。此时此刻，面对这“上帝之手”的伟大杰作，倾听导游讲述那一个个美妙动人的传说，没有人不惊叹大自然的鬼斧神工。\n地下暗河是溶洞的血脉。日夜奔流、生生不息的洞天河，使鸡冠洞有了动感与活力。那滴水凝石的力量，在亿万年中成就了今日的奇绝美景，也在绵延着更为美妙壮观的造化。在鸡冠洞内聆听水声，是一种超凡脱俗的享受。屏息凝神，细听水声，仿佛聆听琼宫仙乐、天籁之音，令人有恍兮惚兮之感。\n最使人记忆深刻的还是名为“千年一吻”和“一吻千年”的两处景观，“千年一吻”和“一吻千年”相距几米，遥相呼应。“千年一吻”上下两块相对的钟乳石相距只有二三厘米，水还在滴滴嗒嗒流着，但据专家测定，这个“吻”接上还需要80年；而另一块情侣石是因为年久从中间裂成两部分，形象极像一男一女在拥吻，于是被定名为“一吻千年”。\n徜徉在鸡冠洞令人陶醉的艺术迷宫里，置身琼楼玉宇、如梦如幻的仙境中，造物主在让人们感受无言之大美的同时，也仿佛有意帮助人们解读一种禅机和哲理：那些神态奇异、惟妙惟肖的钟乳石雕塑艺术精品，是造物主用神奇之手锲而不舍地精雕细琢了亿万年才呈现给世人的。尽管孕育美的过程孤寂漫长，历经沧海桑田，但它一露面便石破天惊，令世人叹服。由此不难想到，真正的美就像滴水凝石，是从一点一滴和日积月累中得来的，容不得半点浮躁和功利，真正的美如同凤凰涅磐，只有在重重火浴中洗礼意志，方可获得永生——创造物质美如此，孕育艺术美、精神美更是如此。",
        collection: 26,
        dateTime: "24小时前",
        headImgSrc: "/images/test/jiguandong1.jpg",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "/images/avatar/3.png",
        postId: 3,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1334295185.mp3",
            title: "写给黄淮-邵帅",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
    {
        title: "黄龙风景",
        content: "黄龙风景名胜区因沟中有许多彩池，随着周围景色变化和阳光照射角度变化变幻出五彩的颜色，被誉为“人间瑶池”。由黄龙沟、丹云峡、牟尼沟、雪宝鼎、雪山梁、红星岩，西沟等景区组成，主景区黄龙沟位于岷山主峰雪宝顶下，面临涪江源流，长7.5千米，宽1.5千米。\n除了高山景观，还可以在这里发现各种不同的森林生态系统，以及石灰岩构造、瀑布和温泉。这一地区还生存着许多濒临灭绝的动物，包括大熊猫和四川疣鼻金丝猴。",
        imgSrc: "/images/test/huanglongfengjing.jpg",
        reading: 96,
        detail: "四川黄龙风景名胜区，遍布碳酸钙华沉淀，享有“世界奇观”的美誉。\n想到四川这个城市，大家能想起来的旅游景点有哪些，肯定有很多游客第一时间想到的就是，四川是不是人手一只大熊猫，确实四川的大熊猫繁育基地，是非常出名的一个旅游特色。",
        collection: 26,
        dateTime: "21小时前",
        headImgSrc: "/images/test/huanglongfengjing.jpg",
        author: "深白色",
        date: "Nov 20 2016",
        avatar: "/images/avatar/5.png",
        postId: 4,
        music: {
          url: "http://music.163.com/song/media/outer/url?id=1344368486.mp3",
            title: "奉献-韩寒",
            coverImg: "https://y.gtimg.cn/music/photo_new/T002R300x300M000002sNbWp3royJG_1.jpg?max_age=2592000"
        }
    },
]

// module.exports = {
//   postList:local_database
// }

// 更简单的导出
export{
  local_database
}

// javascript 模块
// this.setData
// 导入 导出
// JS 模块导入导出